# ISaveSharedCoordinatesCallbackForUnloadLocally Interface

---
C#Visual BasicVisual C++
Revit 2024 API
---
ISaveSharedCoordinatesCallbackForUnloadLocally Interface
Members See Also
---
An interface that is used to control Revit when trying to unload locally a Revit link with changes in shared coordinates.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public interface ISaveSharedCoordinatesCallbackForUnloadLocally
```

Visual Basic
---
```text
Public Interface ISaveSharedCoordinatesCallbackForUnloadLocally
```

Visual C++
---
```text
public interface class ISaveSharedCoordinatesCallbackForUnloadLocally
```

# See Also
ISaveSharedCoordinatesCallbackForUnloadLocally Members
Autodesk.Revit.DB Namespace